bookpage/app/controllers/bookmanage_controller.rb

SELECT "bookmanages".* FROM "bookmanages"
---
    def index
        render json: Bookmanage.all

SELECT "bookmanages".* FROM "bookmanages" WHERE "bookmanages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        v = Bookmanage.find(params[:id])

INSERT INTO "bookmanages" ("bookName", "bookAuthor", "bookQuantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bookName", "Harry Potter"], ["bookAuthor", "JK Rowling"], ["bookQuantity", 4], ["created_at", "2023-01-16 15:32:44.357115"], ["updated_at", "2023-01-16 15:32:44.357115"]]
---
    def create
        v = !params[:bookName].empty? and !params[:bookAuthor].empty?

        if (v)
              p=Bookmanage.create(
              'bookName': params[:bookName],
              'bookAuthor': params[:bookAuthor],
              'bookQuantity': params[:bookQuantity]
            )