bookpage/app/controllers/booksearch_controller.rb

SELECT "bookmanages".* FROM "bookmanages" WHERE "bookmanages"."bookAuthor" = $1 LIMIT $2  [["bookAuthor", "KK devi"], ["LIMIT", 1]]
SELECT "bookmanages".* FROM "bookmanages" WHERE "bookmanages"."bookName" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def create
        usr = Bookmanage.find_by('bookAuthor': params[:bookAuthor])
        if (usr.nil?)
            render json: "book exist"
            # render json: usr
        else
            usr = Bookmanage.find_by('bookName': params[:bookName])